MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GP806/mcu.h
extern volatile IC11CON1BITS IC11CON1bits __attribute__((__sfr__));

#define IC11CON2 IC11CON2
extern volatile uint16_t IC11CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC11CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC11CON2BITS;
extern volatile IC11CON2BITS IC11CON2bits __attribute__((__sfr__));

#define IC11BUF IC11BUF
extern volatile uint16_t IC11BUF __attribute__((__sfr__));
#define IC11TMR IC11TMR
extern volatile uint16_t IC11TMR __attribute__((__sfr__));
#define IC12CON1 IC12CON1
extern volatile uint16_t IC12CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC12CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC12CON1BITS;
extern volatile IC12CON1BITS IC12CON1bits __attribute__((__sfr__));

#define IC12CON2 IC12CON2
extern volatile uint16_t IC12CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC12CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC12CON2BITS;
extern volatile IC12CON2BITS IC12CON2bits __attribute__((__sfr__));

#define IC12BUF IC12BUF
extern volatile uint16_t IC12BUF __attribute__((__sfr__));
#define IC12TMR IC12TMR
extern volatile uint16_t IC12TMR __attribute__((__sfr__));
#define IC13CON1 IC13CON1
extern volatile uint16_t IC13CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC13CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC13CON1BITS;
extern volatile IC13CON1BITS IC13CON1bits __attribute__((__sfr__));

#define IC13CON2 IC13CON2
extern volatile uint16_t IC13CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC13CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC13CON2BITS;
extern volatile IC13CON2BITS IC13CON2bits __attribute__((__sfr__));

#define IC13BUF IC13BUF
extern volatile uint16_t IC13BUF __attribute__((__sfr__));
#define IC13TMR IC13TMR
extern volatile uint16_t IC13TMR __attribute__((__sfr__));
#define IC14CON1 IC14CON1
extern volatile uint16_t IC14CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC14CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC14CON1BITS;
extern volatile IC14CON1BITS IC14CON1bits __attribute__((__sfr__));

#define IC14CON2 IC14CON2
extern volatile uint16_t IC14CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC14CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC14CON2BITS;
extern volatile IC14CON2BITS IC14CON2bits __attribute__((__sfr__));

#define IC14BUF IC14BUF
extern volatile uint16_t IC14BUF __attribute__((__sfr__));
#define IC14TMR IC14TMR
extern volatile uint16_t IC14TMR __attribute__((__sfr__));
#define IC15CON1 IC15CON1
extern volatile uint16_t IC15CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC15CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC15CON1BITS;
extern volatile IC15CON1BITS IC15CON1bits __attribute__((__sfr__));

#define IC15CON2 IC15CON2
extern volatile uint16_t IC15CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC15CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC15CON2BITS;
extern volatile IC15CON2BITS IC15CON2bits __attribute__((__sfr__));

#define IC15BUF IC15BUF
extern volatile uint16_t IC15BUF __attribute__((__sfr__));
#define IC15TMR IC15TMR
extern volatile uint16_t IC15TMR __attribute__((__sfr__));
#define IC16CON1 IC16CON1
extern volatile uint16_t IC16CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC16CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC16CON1BITS;
extern volatile IC16CON1BITS IC16CON1bits __attribute__((__sfr__));

#define IC16CON2 IC16CON2
extern volatile uint16_t IC16CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC16CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC16CON2BITS;
extern volatile IC16CON2BITS IC16CON2bits __attribute__((__sfr__));

