MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GP806/mcu.h
#define _AD2CHS0_CH0SB_POSITION                  0x00000008
#define _AD2CHS0_CH0SB_MASK                      0x00001F00
#define _AD2CHS0_CH0SB_LENGTH                    0x00000005

#define _AD2CHS0_CH0NB_POSITION                  0x0000000F
#define _AD2CHS0_CH0NB_MASK                      0x00008000
#define _AD2CHS0_CH0NB_LENGTH                    0x00000001

#define _AD2CHS0_CH0SA0_POSITION                 0x00000000
#define _AD2CHS0_CH0SA0_MASK                     0x00000001
#define _AD2CHS0_CH0SA0_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA1_POSITION                 0x00000001
#define _AD2CHS0_CH0SA1_MASK                     0x00000002
#define _AD2CHS0_CH0SA1_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA2_POSITION                 0x00000002
#define _AD2CHS0_CH0SA2_MASK                     0x00000004
#define _AD2CHS0_CH0SA2_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA3_POSITION                 0x00000003
#define _AD2CHS0_CH0SA3_MASK                     0x00000008
#define _AD2CHS0_CH0SA3_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA4_POSITION                 0x00000004
#define _AD2CHS0_CH0SA4_MASK                     0x00000010
#define _AD2CHS0_CH0SA4_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB0_POSITION                 0x00000008
#define _AD2CHS0_CH0SB0_MASK                     0x00000100
#define _AD2CHS0_CH0SB0_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB1_POSITION                 0x00000009
#define _AD2CHS0_CH0SB1_MASK                     0x00000200
#define _AD2CHS0_CH0SB1_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB2_POSITION                 0x0000000A
#define _AD2CHS0_CH0SB2_MASK                     0x00000400
#define _AD2CHS0_CH0SB2_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB3_POSITION                 0x0000000B
#define _AD2CHS0_CH0SB3_MASK                     0x00000800
#define _AD2CHS0_CH0SB3_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB4_POSITION                 0x0000000C
#define _AD2CHS0_CH0SB4_MASK                     0x00001000
#define _AD2CHS0_CH0SB4_LENGTH                   0x00000001

#define _AD2CSSL_CSS0_POSITION                   0x00000000
#define _AD2CSSL_CSS0_MASK                       0x00000001
#define _AD2CSSL_CSS0_LENGTH                     0x00000001

#define _AD2CSSL_CSS1_POSITION                   0x00000001
#define _AD2CSSL_CSS1_MASK                       0x00000002
#define _AD2CSSL_CSS1_LENGTH                     0x00000001

#define _AD2CSSL_CSS2_POSITION                   0x00000002
#define _AD2CSSL_CSS2_MASK                       0x00000004
#define _AD2CSSL_CSS2_LENGTH                     0x00000001

#define _AD2CSSL_CSS3_POSITION                   0x00000003
#define _AD2CSSL_CSS3_MASK                       0x00000008
#define _AD2CSSL_CSS3_LENGTH                     0x00000001

#define _AD2CSSL_CSS4_POSITION                   0x00000004
#define _AD2CSSL_CSS4_MASK                       0x00000010
#define _AD2CSSL_CSS4_LENGTH                     0x00000001

#define _AD2CSSL_CSS5_POSITION                   0x00000005
#define _AD2CSSL_CSS5_MASK                       0x00000020
#define _AD2CSSL_CSS5_LENGTH                     0x00000001

#define _AD2CSSL_CSS6_POSITION                   0x00000006
#define _AD2CSSL_CSS6_MASK                       0x00000040
#define _AD2CSSL_CSS6_LENGTH                     0x00000001

#define _AD2CSSL_CSS7_POSITION                   0x00000007
#define _AD2CSSL_CSS7_MASK                       0x00000080
#define _AD2CSSL_CSS7_LENGTH                     0x00000001

#define _AD2CSSL_CSS8_POSITION                   0x00000008
#define _AD2CSSL_CSS8_MASK                       0x00000100
#define _AD2CSSL_CSS8_LENGTH                     0x00000001

#define _AD2CSSL_CSS9_POSITION                   0x00000009
#define _AD2CSSL_CSS9_MASK                       0x00000200
#define _AD2CSSL_CSS9_LENGTH                     0x00000001

#define _AD2CSSL_CSS10_POSITION                  0x0000000A
#define _AD2CSSL_CSS10_MASK                      0x00000400
#define _AD2CSSL_CSS10_LENGTH                    0x00000001

#define _AD2CSSL_CSS11_POSITION                  0x0000000B
#define _AD2CSSL_CSS11_MASK                      0x00000800
#define _AD2CSSL_CSS11_LENGTH                    0x00000001

#define _AD2CSSL_CSS12_POSITION                  0x0000000C
#define _AD2CSSL_CSS12_MASK                      0x00001000
#define _AD2CSSL_CSS12_LENGTH                    0x00000001

#define _AD2CSSL_CSS13_POSITION                  0x0000000D
#define _AD2CSSL_CSS13_MASK                      0x00002000
#define _AD2CSSL_CSS13_LENGTH                    0x00000001

#define _AD2CSSL_CSS14_POSITION                  0x0000000E
#define _AD2CSSL_CSS14_MASK                      0x00004000
#define _AD2CSSL_CSS14_LENGTH                    0x00000001

#define _AD2CSSL_CSS15_POSITION                  0x0000000F
#define _AD2CSSL_CSS15_MASK                      0x00008000
#define _AD2CSSL_CSS15_LENGTH                    0x00000001

#define _AD2CON4_DMABL_POSITION                  0x00000000
#define _AD2CON4_DMABL_MASK                      0x00000007
#define _AD2CON4_DMABL_LENGTH                    0x00000003

#define _AD2CON4_ADDMAEN_POSITION                0x00000008
#define _AD2CON4_ADDMAEN_MASK                    0x00000100
#define _AD2CON4_ADDMAEN_LENGTH                  0x00000001

#define _AD2CON4_DMABL0_POSITION                 0x00000000
#define _AD2CON4_DMABL0_MASK                     0x00000001
#define _AD2CON4_DMABL0_LENGTH                   0x00000001

#define _AD2CON4_DMABL1_POSITION                 0x00000001
#define _AD2CON4_DMABL1_MASK                     0x00000002
#define _AD2CON4_DMABL1_LENGTH                   0x00000001

#define _AD2CON4_DMABL2_POSITION                 0x00000002
#define _AD2CON4_DMABL2_MASK                     0x00000004
#define _AD2CON4_DMABL2_LENGTH                   0x00000001

#define _C1CTRL1_WIN_POSITION                    0x00000000
#define _C1CTRL1_WIN_MASK                        0x00000001
#define _C1CTRL1_WIN_LENGTH                      0x00000001

#define _C1CTRL1_CANCAP_POSITION                 0x00000003
#define _C1CTRL1_CANCAP_MASK                     0x00000008
#define _C1CTRL1_CANCAP_LENGTH                   0x00000001

#define _C1CTRL1_OPMODE_POSITION                 0x00000005
#define _C1CTRL1_OPMODE_MASK                     0x000000E0
#define _C1CTRL1_OPMODE_LENGTH                   0x00000003

