MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GP806/mcu.h
#define _RPOR13_RP118R_POSITION                  0x00000008
#define _RPOR13_RP118R_MASK                      0x00003F00
#define _RPOR13_RP118R_LENGTH                    0x00000006

#define _RPOR13_RP118R0_POSITION                 0x00000008
#define _RPOR13_RP118R0_MASK                     0x00000100
#define _RPOR13_RP118R0_LENGTH                   0x00000001

#define _RPOR13_RP118R1_POSITION                 0x00000009
#define _RPOR13_RP118R1_MASK                     0x00000200
#define _RPOR13_RP118R1_LENGTH                   0x00000001

#define _RPOR13_RP118R2_POSITION                 0x0000000A
#define _RPOR13_RP118R2_MASK                     0x00000400
#define _RPOR13_RP118R2_LENGTH                   0x00000001

#define _RPOR13_RP118R3_POSITION                 0x0000000B
#define _RPOR13_RP118R3_MASK                     0x00000800
#define _RPOR13_RP118R3_LENGTH                   0x00000001

#define _RPOR13_RP118R4_POSITION                 0x0000000C
#define _RPOR13_RP118R4_MASK                     0x00001000
#define _RPOR13_RP118R4_LENGTH                   0x00000001

#define _RPOR13_RP118R5_POSITION                 0x0000000D
#define _RPOR13_RP118R5_MASK                     0x00002000
#define _RPOR13_RP118R5_LENGTH                   0x00000001

#define _RPOR14_RP120R_POSITION                  0x00000000
#define _RPOR14_RP120R_MASK                      0x0000003F
#define _RPOR14_RP120R_LENGTH                    0x00000006

#define _RPOR14_RP120R0_POSITION                 0x00000000
#define _RPOR14_RP120R0_MASK                     0x00000001
#define _RPOR14_RP120R0_LENGTH                   0x00000001

#define _RPOR14_RP120R1_POSITION                 0x00000001
#define _RPOR14_RP120R1_MASK                     0x00000002
#define _RPOR14_RP120R1_LENGTH                   0x00000001

#define _RPOR14_RP120R2_POSITION                 0x00000002
#define _RPOR14_RP120R2_MASK                     0x00000004
#define _RPOR14_RP120R2_LENGTH                   0x00000001

#define _RPOR14_RP120R3_POSITION                 0x00000003
#define _RPOR14_RP120R3_MASK                     0x00000008
#define _RPOR14_RP120R3_LENGTH                   0x00000001

#define _RPOR14_RP120R4_POSITION                 0x00000004
#define _RPOR14_RP120R4_MASK                     0x00000010
#define _RPOR14_RP120R4_LENGTH                   0x00000001

#define _RPOR14_RP120R5_POSITION                 0x00000005
#define _RPOR14_RP120R5_MASK                     0x00000020
#define _RPOR14_RP120R5_LENGTH                   0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00007F00
#define _RPINR0_INT1R_LENGTH                     0x00000007

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR0_INT1R6_POSITION                  0x0000000E
#define _RPINR0_INT1R6_MASK                      0x00004000
#define _RPINR0_INT1R6_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000007F
#define _RPINR1_INT2R_LENGTH                     0x00000007

#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x00007F00
#define _RPINR1_INT3R_LENGTH                     0x00000007

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

#define _RPINR1_INT2R6_POSITION                  0x00000006
#define _RPINR1_INT2R6_MASK                      0x00000040
#define _RPINR1_INT2R6_LENGTH                    0x00000001

#define _RPINR1_INT3R0_POSITION                  0x00000008
#define _RPINR1_INT3R0_MASK                      0x00000100
#define _RPINR1_INT3R0_LENGTH                    0x00000001

#define _RPINR1_INT3R1_POSITION                  0x00000009
#define _RPINR1_INT3R1_MASK                      0x00000200
#define _RPINR1_INT3R1_LENGTH                    0x00000001

#define _RPINR1_INT3R2_POSITION                  0x0000000A
#define _RPINR1_INT3R2_MASK                      0x00000400
#define _RPINR1_INT3R2_LENGTH                    0x00000001

#define _RPINR1_INT3R3_POSITION                  0x0000000B
#define _RPINR1_INT3R3_MASK                      0x00000800
#define _RPINR1_INT3R3_LENGTH                    0x00000001

#define _RPINR1_INT3R4_POSITION                  0x0000000C
#define _RPINR1_INT3R4_MASK                      0x00001000
#define _RPINR1_INT3R4_LENGTH                    0x00000001

