MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GP806/mcu.h
#define _RPINR36_IC15R5_POSITION                 0x00000005
#define _RPINR36_IC15R5_MASK                     0x00000020
#define _RPINR36_IC15R5_LENGTH                   0x00000001

#define _RPINR36_IC15R6_POSITION                 0x00000006
#define _RPINR36_IC15R6_MASK                     0x00000040
#define _RPINR36_IC15R6_LENGTH                   0x00000001

#define _RPINR36_IC16R0_POSITION                 0x00000008
#define _RPINR36_IC16R0_MASK                     0x00000100
#define _RPINR36_IC16R0_LENGTH                   0x00000001

#define _RPINR36_IC16R1_POSITION                 0x00000009
#define _RPINR36_IC16R1_MASK                     0x00000200
#define _RPINR36_IC16R1_LENGTH                   0x00000001

#define _RPINR36_IC16R2_POSITION                 0x0000000A
#define _RPINR36_IC16R2_MASK                     0x00000400
#define _RPINR36_IC16R2_LENGTH                   0x00000001

#define _RPINR36_IC16R3_POSITION                 0x0000000B
#define _RPINR36_IC16R3_MASK                     0x00000800
#define _RPINR36_IC16R3_LENGTH                   0x00000001

#define _RPINR36_IC16R4_POSITION                 0x0000000C
#define _RPINR36_IC16R4_MASK                     0x00001000
#define _RPINR36_IC16R4_LENGTH                   0x00000001

#define _RPINR36_IC16R5_POSITION                 0x0000000D
#define _RPINR36_IC16R5_MASK                     0x00002000
#define _RPINR36_IC16R5_LENGTH                   0x00000001

#define _RPINR36_IC16R6_POSITION                 0x0000000E
#define _RPINR36_IC16R6_MASK                     0x00004000
#define _RPINR36_IC16R6_LENGTH                   0x00000001

#define _RPINR37_OCFCR_POSITION                  0x00000000
#define _RPINR37_OCFCR_MASK                      0x0000007F
#define _RPINR37_OCFCR_LENGTH                    0x00000007

#define _RPINR37_OCFCR0_POSITION                 0x00000000
#define _RPINR37_OCFCR0_MASK                     0x00000001
#define _RPINR37_OCFCR0_LENGTH                   0x00000001

#define _RPINR37_OCFCR1_POSITION                 0x00000001
#define _RPINR37_OCFCR1_MASK                     0x00000002
#define _RPINR37_OCFCR1_LENGTH                   0x00000001

#define _RPINR37_OCFCR2_POSITION                 0x00000002
#define _RPINR37_OCFCR2_MASK                     0x00000004
#define _RPINR37_OCFCR2_LENGTH                   0x00000001

#define _RPINR37_OCFCR3_POSITION                 0x00000003
#define _RPINR37_OCFCR3_MASK                     0x00000008
#define _RPINR37_OCFCR3_LENGTH                   0x00000001

#define _RPINR37_OCFCR4_POSITION                 0x00000004
#define _RPINR37_OCFCR4_MASK                     0x00000010
#define _RPINR37_OCFCR4_LENGTH                   0x00000001

#define _RPINR37_OCFCR5_POSITION                 0x00000005
#define _RPINR37_OCFCR5_MASK                     0x00000020
#define _RPINR37_OCFCR5_LENGTH                   0x00000001

#define _RPINR37_OCFCR6_POSITION                 0x00000006
#define _RPINR37_OCFCR6_MASK                     0x00000040
#define _RPINR37_OCFCR6_LENGTH                   0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADRU_NVMADRU_POSITION                0x00000000
#define _NVMADRU_NVMADRU_MASK                    0x000000FF
#define _NVMADRU_NVMADRU_LENGTH                  0x00000008

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_CM_POSITION                        0x00000009
#define _RCON_CM_MASK                            0x00000200
#define _RCON_CM_LENGTH                          0x00000001

#define _RCON_VREGSF_POSITION                    0x0000000B
#define _RCON_VREGSF_MASK                        0x00000800
#define _RCON_VREGSF_LENGTH                      0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_LPOSCEN_POSITION                 0x00000001
#define _OSCCON_LPOSCEN_MASK                     0x00000002
#define _OSCCON_LPOSCEN_LENGTH                   0x00000001

