MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GP806/mcu.h
#define _IFS4_C1TXIF_POSITION                    0x00000006
#define _IFS4_C1TXIF_MASK                        0x00000040
#define _IFS4_C1TXIF_LENGTH                      0x00000001

#define _IFS4_C2TXIF_POSITION                    0x00000007
#define _IFS4_C2TXIF_MASK                        0x00000080
#define _IFS4_C2TXIF_LENGTH                      0x00000001

#define _IFS5_U3EIF_POSITION                     0x00000001
#define _IFS5_U3EIF_MASK                         0x00000002
#define _IFS5_U3EIF_LENGTH                       0x00000001

#define _IFS5_U3RXIF_POSITION                    0x00000002
#define _IFS5_U3RXIF_MASK                        0x00000004
#define _IFS5_U3RXIF_LENGTH                      0x00000001

#define _IFS5_U3TXIF_POSITION                    0x00000003
#define _IFS5_U3TXIF_MASK                        0x00000008
#define _IFS5_U3TXIF_LENGTH                      0x00000001

#define _IFS5_U4EIF_POSITION                     0x00000007
#define _IFS5_U4EIF_MASK                         0x00000080
#define _IFS5_U4EIF_LENGTH                       0x00000001

#define _IFS5_U4RXIF_POSITION                    0x00000008
#define _IFS5_U4RXIF_MASK                        0x00000100
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x00000009
#define _IFS5_U4TXIF_MASK                        0x00000200
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_SPI3EIF_POSITION                   0x0000000A
#define _IFS5_SPI3EIF_MASK                       0x00000400
#define _IFS5_SPI3EIF_LENGTH                     0x00000001

#define _IFS5_SPI3IF_POSITION                    0x0000000B
#define _IFS5_SPI3IF_MASK                        0x00000800
#define _IFS5_SPI3IF_LENGTH                      0x00000001

#define _IFS5_OC9IF_POSITION                     0x0000000C
#define _IFS5_OC9IF_MASK                         0x00001000
#define _IFS5_OC9IF_LENGTH                       0x00000001

#define _IFS5_IC9IF_POSITION                     0x0000000D
#define _IFS5_IC9IF_MASK                         0x00002000
#define _IFS5_IC9IF_LENGTH                       0x00000001

#define _IFS7_DMA8IF_POSITION                    0x00000006
#define _IFS7_DMA8IF_MASK                        0x00000040
#define _IFS7_DMA8IF_LENGTH                      0x00000001

#define _IFS7_DMA9IF_POSITION                    0x00000007
#define _IFS7_DMA9IF_MASK                        0x00000080
#define _IFS7_DMA9IF_LENGTH                      0x00000001

#define _IFS7_DMA10IF_POSITION                   0x00000008
#define _IFS7_DMA10IF_MASK                       0x00000100
#define _IFS7_DMA10IF_LENGTH                     0x00000001

#define _IFS7_DMA11IF_POSITION                   0x00000009
#define _IFS7_DMA11IF_MASK                       0x00000200
#define _IFS7_DMA11IF_LENGTH                     0x00000001

#define _IFS7_SPI4EIF_POSITION                   0x0000000A
#define _IFS7_SPI4EIF_MASK                       0x00000400
#define _IFS7_SPI4EIF_LENGTH                     0x00000001

#define _IFS7_SPI4IF_POSITION                    0x0000000B
#define _IFS7_SPI4IF_MASK                        0x00000800
#define _IFS7_SPI4IF_LENGTH                      0x00000001

#define _IFS7_OC10IF_POSITION                    0x0000000C
#define _IFS7_OC10IF_MASK                        0x00001000
#define _IFS7_OC10IF_LENGTH                      0x00000001

#define _IFS7_IC10IF_POSITION                    0x0000000D
#define _IFS7_IC10IF_MASK                        0x00002000
#define _IFS7_IC10IF_LENGTH                      0x00000001

#define _IFS7_OC11IF_POSITION                    0x0000000E
#define _IFS7_OC11IF_MASK                        0x00004000
#define _IFS7_OC11IF_LENGTH                      0x00000001

#define _IFS7_IC11IF_POSITION                    0x0000000F
#define _IFS7_IC11IF_MASK                        0x00008000
#define _IFS7_IC11IF_LENGTH                      0x00000001

#define _IFS8_OC12IF_POSITION                    0x00000000
#define _IFS8_OC12IF_MASK                        0x00000001
#define _IFS8_OC12IF_LENGTH                      0x00000001

#define _IFS8_IC12IF_POSITION                    0x00000001
#define _IFS8_IC12IF_MASK                        0x00000002
#define _IFS8_IC12IF_LENGTH                      0x00000001

#define _IFS8_DMA12IF_POSITION                   0x00000002
#define _IFS8_DMA12IF_MASK                       0x00000004
#define _IFS8_DMA12IF_LENGTH                     0x00000001

#define _IFS8_DMA13IF_POSITION                   0x00000003
#define _IFS8_DMA13IF_MASK                       0x00000008
#define _IFS8_DMA13IF_LENGTH                     0x00000001

#define _IFS8_DMA14IF_POSITION                   0x00000004
#define _IFS8_DMA14IF_MASK                       0x00000010
#define _IFS8_DMA14IF_LENGTH                     0x00000001

#define _IFS8_OC13IF_POSITION                    0x00000006
#define _IFS8_OC13IF_MASK                        0x00000040
#define _IFS8_OC13IF_LENGTH                      0x00000001

#define _IFS8_IC13IF_POSITION                    0x00000007
#define _IFS8_IC13IF_MASK                        0x00000080
#define _IFS8_IC13IF_LENGTH                      0x00000001

#define _IFS8_OC14IF_POSITION                    0x00000008
#define _IFS8_OC14IF_MASK                        0x00000100
#define _IFS8_OC14IF_LENGTH                      0x00000001

#define _IFS8_IC14IF_POSITION                    0x00000009
#define _IFS8_IC14IF_MASK                        0x00000200
#define _IFS8_IC14IF_LENGTH                      0x00000001

#define _IFS8_OC15IF_POSITION                    0x0000000A
#define _IFS8_OC15IF_MASK                        0x00000400
#define _IFS8_OC15IF_LENGTH                      0x00000001

#define _IFS8_IC15IF_POSITION                    0x0000000B
#define _IFS8_IC15IF_MASK                        0x00000800
#define _IFS8_IC15IF_LENGTH                      0x00000001

#define _IFS8_OC16IF_POSITION                    0x0000000C
#define _IFS8_OC16IF_MASK                        0x00001000
#define _IFS8_OC16IF_LENGTH                      0x00000001

#define _IFS8_IC16IF_POSITION                    0x0000000D
#define _IFS8_IC16IF_MASK                        0x00002000
#define _IFS8_IC16IF_LENGTH                      0x00000001

#define _IFS8_ICDIF_POSITION                     0x0000000E
#define _IFS8_ICDIF_MASK                         0x00004000
#define _IFS8_ICDIF_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_DMA0IE_POSITION                    0x00000004
#define _IEC0_DMA0IE_MASK                        0x00000010
#define _IEC0_DMA0IE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000005
#define _IEC0_IC2IE_MASK                         0x00000020
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000006
#define _IEC0_OC2IE_MASK                         0x00000040
#define _IEC0_OC2IE_LENGTH                       0x00000001

