MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GP806/mcu.h
#define _IPC17_DMA6IP2_POSITION                  0x00000002
#define _IPC17_DMA6IP2_MASK                      0x00000004
#define _IPC17_DMA6IP2_LENGTH                    0x00000001

#define _IPC17_DMA7IP0_POSITION                  0x00000004
#define _IPC17_DMA7IP0_MASK                      0x00000010
#define _IPC17_DMA7IP0_LENGTH                    0x00000001

#define _IPC17_DMA7IP1_POSITION                  0x00000005
#define _IPC17_DMA7IP1_MASK                      0x00000020
#define _IPC17_DMA7IP1_LENGTH                    0x00000001

#define _IPC17_DMA7IP2_POSITION                  0x00000006
#define _IPC17_DMA7IP2_MASK                      0x00000040
#define _IPC17_DMA7IP2_LENGTH                    0x00000001

#define _IPC17_C1TXIP0_POSITION                  0x00000008
#define _IPC17_C1TXIP0_MASK                      0x00000100
#define _IPC17_C1TXIP0_LENGTH                    0x00000001

#define _IPC17_C1TXIP1_POSITION                  0x00000009
#define _IPC17_C1TXIP1_MASK                      0x00000200
#define _IPC17_C1TXIP1_LENGTH                    0x00000001

#define _IPC17_C1TXIP2_POSITION                  0x0000000A
#define _IPC17_C1TXIP2_MASK                      0x00000400
#define _IPC17_C1TXIP2_LENGTH                    0x00000001

#define _IPC17_C2TXIP0_POSITION                  0x0000000C
#define _IPC17_C2TXIP0_MASK                      0x00001000
#define _IPC17_C2TXIP0_LENGTH                    0x00000001

#define _IPC17_C2TXIP1_POSITION                  0x0000000D
#define _IPC17_C2TXIP1_MASK                      0x00002000
#define _IPC17_C2TXIP1_LENGTH                    0x00000001

#define _IPC17_C2TXIP2_POSITION                  0x0000000E
#define _IPC17_C2TXIP2_MASK                      0x00004000
#define _IPC17_C2TXIP2_LENGTH                    0x00000001

#define _IPC20_U3EIP_POSITION                    0x00000004
#define _IPC20_U3EIP_MASK                        0x00000070
#define _IPC20_U3EIP_LENGTH                      0x00000003

#define _IPC20_U3RXIP_POSITION                   0x00000008
#define _IPC20_U3RXIP_MASK                       0x00000700
#define _IPC20_U3RXIP_LENGTH                     0x00000003

#define _IPC20_U3TXIP_POSITION                   0x0000000C
#define _IPC20_U3TXIP_MASK                       0x00007000
#define _IPC20_U3TXIP_LENGTH                     0x00000003

#define _IPC20_U3EIP0_POSITION                   0x00000004
#define _IPC20_U3EIP0_MASK                       0x00000010
#define _IPC20_U3EIP0_LENGTH                     0x00000001

#define _IPC20_U3EIP1_POSITION                   0x00000005
#define _IPC20_U3EIP1_MASK                       0x00000020
#define _IPC20_U3EIP1_LENGTH                     0x00000001

#define _IPC20_U3EIP2_POSITION                   0x00000006
#define _IPC20_U3EIP2_MASK                       0x00000040
#define _IPC20_U3EIP2_LENGTH                     0x00000001

#define _IPC20_U3RXIP0_POSITION                  0x00000008
#define _IPC20_U3RXIP0_MASK                      0x00000100
#define _IPC20_U3RXIP0_LENGTH                    0x00000001

#define _IPC20_U3RXIP1_POSITION                  0x00000009
#define _IPC20_U3RXIP1_MASK                      0x00000200
#define _IPC20_U3RXIP1_LENGTH                    0x00000001

#define _IPC20_U3RXIP2_POSITION                  0x0000000A
#define _IPC20_U3RXIP2_MASK                      0x00000400
#define _IPC20_U3RXIP2_LENGTH                    0x00000001

#define _IPC20_U3TXIP0_POSITION                  0x0000000C
#define _IPC20_U3TXIP0_MASK                      0x00001000
#define _IPC20_U3TXIP0_LENGTH                    0x00000001

#define _IPC20_U3TXIP1_POSITION                  0x0000000D
#define _IPC20_U3TXIP1_MASK                      0x00002000
#define _IPC20_U3TXIP1_LENGTH                    0x00000001

#define _IPC20_U3TXIP2_POSITION                  0x0000000E
#define _IPC20_U3TXIP2_MASK                      0x00004000
#define _IPC20_U3TXIP2_LENGTH                    0x00000001

#define _IPC21_U4EIP_POSITION                    0x0000000C
#define _IPC21_U4EIP_MASK                        0x00007000
#define _IPC21_U4EIP_LENGTH                      0x00000003

#define _IPC21_U4EIP0_POSITION                   0x0000000C
#define _IPC21_U4EIP0_MASK                       0x00001000
#define _IPC21_U4EIP0_LENGTH                     0x00000001

#define _IPC21_U4EIP1_POSITION                   0x0000000D
#define _IPC21_U4EIP1_MASK                       0x00002000
#define _IPC21_U4EIP1_LENGTH                     0x00000001

#define _IPC21_U4EIP2_POSITION                   0x0000000E
#define _IPC21_U4EIP2_MASK                       0x00004000
#define _IPC21_U4EIP2_LENGTH                     0x00000001

#define _IPC22_U4RXIP_POSITION                   0x00000000
#define _IPC22_U4RXIP_MASK                       0x00000007
#define _IPC22_U4RXIP_LENGTH                     0x00000003

#define _IPC22_U4TXIP_POSITION                   0x00000004
#define _IPC22_U4TXIP_MASK                       0x00000070
#define _IPC22_U4TXIP_LENGTH                     0x00000003

#define _IPC22_SPI3EIP_POSITION                  0x00000008
#define _IPC22_SPI3EIP_MASK                      0x00000700
#define _IPC22_SPI3EIP_LENGTH                    0x00000003

#define _IPC22_SPI3IP_POSITION                   0x0000000C
#define _IPC22_SPI3IP_MASK                       0x00007000
#define _IPC22_SPI3IP_LENGTH                     0x00000003

#define _IPC22_U4RXIP0_POSITION                  0x00000000
#define _IPC22_U4RXIP0_MASK                      0x00000001
#define _IPC22_U4RXIP0_LENGTH                    0x00000001

#define _IPC22_U4RXIP1_POSITION                  0x00000001
#define _IPC22_U4RXIP1_MASK                      0x00000002
#define _IPC22_U4RXIP1_LENGTH                    0x00000001

#define _IPC22_U4RXIP2_POSITION                  0x00000002
#define _IPC22_U4RXIP2_MASK                      0x00000004
#define _IPC22_U4RXIP2_LENGTH                    0x00000001

#define _IPC22_U4TXIP0_POSITION                  0x00000004
#define _IPC22_U4TXIP0_MASK                      0x00000010
#define _IPC22_U4TXIP0_LENGTH                    0x00000001

#define _IPC22_U4TXIP1_POSITION                  0x00000005
#define _IPC22_U4TXIP1_MASK                      0x00000020
#define _IPC22_U4TXIP1_LENGTH                    0x00000001

#define _IPC22_U4TXIP2_POSITION                  0x00000006
#define _IPC22_U4TXIP2_MASK                      0x00000040
#define _IPC22_U4TXIP2_LENGTH                    0x00000001

#define _IPC22_SPI3EIP0_POSITION                 0x00000008
#define _IPC22_SPI3EIP0_MASK                     0x00000100
#define _IPC22_SPI3EIP0_LENGTH                   0x00000001

